org/redes/13.org
#+title: Capa de Enlace: LAN Ethernet

* DONE Switched LANs 524
** Ethernet

*** Frame Ethernet
    imagen 6.20

    | Preamble | Destination Address | Source Address | Type | Data | CRC |

    - Data field (46 to 1,500 bytes) :: This field carries the IP datagram. The
      maximum transmission unit (MTU) of Ethernet is 1,500 bytes. This means that if
      the IP datagram exceeds 1,500 bytes, then the host has to fragment the
      datagram. The minimum size of the data field is
      46 bytes. This means that if the IP datagram is less than 46 bytes, the data
      field has to be “stuffed” to fill it out to 46 bytes. When stuffing is used,
      the data passed to the network layer contains the stuffing as well as an IP
      datagram. The network layer uses the length field in the IP datagram header to
      remove the stuffing.

    - Destination address (6 bytes) :: This field contains the MAC address of the
      destination adapter. When the destination adapter receives an Ethernet frame
      whose destination address is either their own address or the MAC broadcast
      address, it passes the contents of the frame’s data field to the network
      layer; if it receives a frame with any other MAC address, it discards the
      frame.

    - Source address (6 bytes) :: This field contains the MAC address of the adapter
      that transmits the frame onto the LAN.

    - Type field (2 bytes) :: The type field permits Ethernet to multiplex
      network-layer protocols. To understand this, we need to keep in mind that
      hosts can use other network-layer protocols besides IP. In fact, a given host
      may support multiple network-layer protocols using different protocols for
      different applications. For this reason, when the Ethernet frame arrives at
      destination adapter, the dest adapter needs to know to which network-layer
      protocol it should pass (demultiplex) the contents of the data field. IP and
      other network-layer protocols (for example, Novell IPX or AppleTalk) each have
      their own, standardized type number. Furthermore, the ARP protocol has its own
      type number, and if the arriving frame contains an ARP packet , the ARP packet
      will be demultiplexed up to the ARP protocol. Note that the type field is
      analogous to the protocol field in the network-layer datagram and the
      port-number fields in the transport-layer segment; all of these fields serve
      to glue a protocol at one layer to aprotocol at the layer above.

    - Cyclic redundancy check (CRC) (4 bytes) :: the purpose of the CRC field is to
      allow the receiving adapter, to detect bit errors in the frame. When a frame
      fails the CRC check, the receiving adapter simply discards the frame.

    - Preamble (8 bytes) :: The Ethernet frame begins with an 8-byte preamble
      field. Each of the first 7 bytes of the preamble has a value of 10101010; the
      last byte is 10101011. The first 7 bytes of the preamble serve to “wake up”
      the receiving adapters and to synchronize their clocks to that of the sender’s
      clock. Why should the clocks be out of synchronization? Keep in mind that the
      sender adapter aims to transmit the frame at 10 Mbps, 100 Mbps, or 1 Gbps,
      depending on the type of Ethernet LAN. However, because nothing is absolutely
      perfect, the sender adapter will not transmit the frame at exactly the target
      rate; there will always be some drift from the target rate, a drift which is
      not known a priori by the other adapters on the LAN. A receiving adapter can
      lock onto the sender adapter’s clock simply by locking onto the bits in the
      first 7 bytes of the preamble. The last 2 bits of the eighth byte of the
      preamble (the first two consecutive 1s) alert the receiving adapter that the
      “important stuff” is about to come.

    All of the Ethernet technologies provide connectionless service to the network
    layer. (no handshake)

*** Tecnologias Ethernet 535

    The IEEE 802.3 CSMA/CD (Ethernet) working group has standardized multiple
    Ethernet technologies.

    For example: 10BASE-T, 10BASE-2, 100BASE-T, 1000BASE-LX, 10GBASE-T and 40GBASE-T

    The first part refers to the speed of the standard.

    “BASE” refers to baseband Ethernet, meaning that the physical media only carries
    Ethernet traffic;

    The final part of the acronym refers to the physical media itself; Ethernet is
    both a link-layer and a physical-layer specification and is carried over a
    variety of physical media including coaxial cable, copper wire, and
    fiber. Generally, a “T” refers to twisted-pair copper wires.

    ```
    habla de Mb ehter y Gb ether
    ```

    Con el uso de switches en ethernet, debido al accionar de los switches (store
    and forward), la necesidad de tener direcciones mac fue dejando de tener
    importancia.

** Switches de capa de enlace

   el rol del switch es recibir frames de capa de enlace entrantes y
   redireccionarlos en enlaces salientes.

   el switch en si es =transparente= para los hosts y routers en la subred, esto
   es, los hosts y routers envian frames a otros hosts y routers, en vez de
   hacerlo a un switch.

   la tasa de arribos a una interfaz de salida de un switch pueden exceder a la
   capacidad del enlace de dicha interfaz. Para resolver esto, se utilizan
   buffers en las interfaces de salida de los switches, justo como los routers
   tienen buffers para los datagramas.

