redes/13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 12:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Capa de Enlace: LAN Ethernet</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="../res/org.css"/>
</head>
<body>
<div id="content">

<div id="outline-container-org43ef785" class="outline-2">
<h2 id="org43ef785"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Switched LANs 524</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org07abf31" class="outline-3">
<h3 id="org07abf31"><span class="section-number-3">1.1</span> Ethernet</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org93355ce" class="outline-4">
<h4 id="org93355ce"><span class="section-number-4">1.1.1</span> Frame Ethernet</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
imagen 6.20
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Preamble</td>
<td class="org-left">Destination Address</td>
<td class="org-left">Source Address</td>
<td class="org-left">Type</td>
<td class="org-left">Data</td>
<td class="org-left">CRC</td>
</tr>
</tbody>
</table>

<dl class="org-dl">
<dt>Data field (46 to 1,500 bytes)</dt><dd>This field carries the IP datagram. The
maximum transmission unit (MTU) of Ethernet is 1,500 bytes. This means that if
the IP datagram exceeds 1,500 bytes, then the host has to fragment the
datagram. The minimum size of the data field is
46 bytes. This means that if the IP datagram is less than 46 bytes, the data
field has to be “stuffed” to fill it out to 46 bytes. When stuffing is used,
the data passed to the network layer contains the stuffing as well as an IP
datagram. The network layer uses the length field in the IP datagram header to
remove the stuffing.</dd>

<dt>Destination address (6 bytes)</dt><dd>This field contains the MAC address of the
destination adapter. When the destination adapter receives an Ethernet frame
whose destination address is either their own address or the MAC broadcast
address, it passes the contents of the frame’s data field to the network
layer; if it receives a frame with any other MAC address, it discards the
frame.</dd>

<dt>Source address (6 bytes)</dt><dd>This field contains the MAC address of the adapter
that transmits the frame onto the LAN.</dd>

<dt>Type field (2 bytes)</dt><dd>The type field permits Ethernet to multiplex
network-layer protocols. To understand this, we need to keep in mind that
hosts can use other network-layer protocols besides IP. In fact, a given host
may support multiple network-layer protocols using different protocols for
different applications. For this reason, when the Ethernet frame arrives at
destination adapter, the dest adapter needs to know to which network-layer
protocol it should pass (demultiplex) the contents of the data field. IP and
other network-layer protocols (for example, Novell IPX or AppleTalk) each have
their own, standardized type number. Furthermore, the ARP protocol has its own
type number, and if the arriving frame contains an ARP packet , the ARP packet
will be demultiplexed up to the ARP protocol. Note that the type field is
analogous to the protocol field in the network-layer datagram and the
port-number fields in the transport-layer segment; all of these fields serve
to glue a protocol at one layer to aprotocol at the layer above.</dd>

<dt>Cyclic redundancy check (CRC) (4 bytes)</dt><dd>the purpose of the CRC field is to
allow the receiving adapter, to detect bit errors in the frame. When a frame
fails the CRC check, the receiving adapter simply discards the frame.</dd>

<dt>Preamble (8 bytes)</dt><dd>The Ethernet frame begins with an 8-byte preamble
field. Each of the first 7 bytes of the preamble has a value of 10101010; the
last byte is 10101011. The first 7 bytes of the preamble serve to “wake up”
the receiving adapters and to synchronize their clocks to that of the sender’s
clock. Why should the clocks be out of synchronization? Keep in mind that the
sender adapter aims to transmit the frame at 10 Mbps, 100 Mbps, or 1 Gbps,
depending on the type of Ethernet LAN. However, because nothing is absolutely
perfect, the sender adapter will not transmit the frame at exactly the target
rate; there will always be some drift from the target rate, a drift which is
not known a priori by the other adapters on the LAN. A receiving adapter can
lock onto the sender adapter’s clock simply by locking onto the bits in the
first 7 bytes of the preamble. The last 2 bits of the eighth byte of the
preamble (the first two consecutive 1s) alert the receiving adapter that the
“important stuff” is about to come.</dd>
</dl>

<p>
All of the Ethernet technologies provide connectionless service to the network
layer. (no handshake)
</p>
</div>
</div>

<div id="outline-container-org4a5886e" class="outline-4">
<h4 id="org4a5886e"><span class="section-number-4">1.1.2</span> Tecnologias Ethernet 535</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The IEEE 802.3 CSMA/CD (Ethernet) working group has standardized multiple
Ethernet technologies.
</p>

<p>
For example: 10BASE-T, 10BASE-2, 100BASE-T, 1000BASE-LX, 10GBASE-T and 40GBASE-T
</p>

<p>
The first part refers to the speed of the standard.
</p>

<p>
“BASE” refers to baseband Ethernet, meaning that the physical media only carries
Ethernet traffic;
</p>

<p>
The final part of the acronym refers to the physical media itself; Ethernet is
both a link-layer and a physical-layer specification and is carried over a
variety of physical media including coaxial cable, copper wire, and
fiber. Generally, a “T” refers to twisted-pair copper wires.
</p>

<p>
```
habla de Mb ehter y Gb ether
```
</p>

<p>
Con el uso de switches en ethernet, debido al accionar de los switches (store
and forward), la necesidad de tener direcciones mac fue dejando de tener
importancia.
</p>
</div>
</div>
</div>

<div id="outline-container-org6c41b31" class="outline-3">
<h3 id="org6c41b31"><span class="section-number-3">1.2</span> Switches de capa de enlace</h3>
<div class="outline-text-3" id="text-1-2">
<p>
el rol del switch es recibir frames de capa de enlace entrantes y
redireccionarlos en enlaces salientes.
</p>

<p>
el switch en si es <code>transparente</code> para los hosts y routers en la subred, esto
es, los hosts y routers envian frames a otros hosts y routers, en vez de
hacerlo a un switch.
</p>

<p>
la tasa de arribos a una interfaz de salida de un switch pueden exceder a la
capacidad del enlace de dicha interfaz. Para resolver esto, se utilizan
buffers en las interfaces de salida de los switches, justo como los routers
tienen buffers para los datagramas.
</p>
</div>
