redes/13.html

<div id="outline-container-org67e2b04" class="outline-4">
<h4 id="org67e2b04"><span class="section-number-4">1.2.1</span> Forwarding y Filtering</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<code>Filtering</code> is the switch function that determines whether a frame should be
forwarded to some interface or should just be dropped.
</p>

<p>
<code>Forwarding</code> is the switch function that determines the interfaces to which a
frame should be directed, and then moves the frame to those interfaces.
</p>

<p>
Switch filtering and forwarding are done with a switch table. The switch
table contains entries for some, but not necessarily all, of the hosts and
routers on a LAN.
</p>

<p>
An entry in the switch table contains:
</p>
<ol class="org-ol">
<li>a MAC address,</li>
<li>the switch interface that leads toward that MAC address, and</li>
<li>the time at which the entry was placed in the table.</li>
</ol>

<p>
imagen 6.22
</p>

<p>
modern packet switches can be configured to forward on the basis of layer-2
destination MAC addresses (i.e., function as a layer-2 switch) or layer-3 IP
destination addresses (i.e., function as a layer-3 router).
</p>

<p>
Traditional switch tables (non-SDN context) are constructed differently from
a routers forwarding tables
</p>

<p>
when a frame arrives at the switch, its destination MAC address is indexed in
the switch table where:
</p>
<ul class="org-ul">
<li>There is no entry in the table for the destination MAC. In this case, the
switch forwards copies of the frame to the output buffers preceding <i>all</i>
interfaces address, the switch broadcasts the frame.</li>
<li>There is an entry but the frame is coming from a LAN segment that contains
adapter with that MAC address. There being no need to forward the frame to
any of the other interfaces, the switch performs the filtering function by
discarding the frame.</li>
<li>There is an entry in the table but this time the asociated interface to the
MAC is different from the LAN segment where the MAC came from. In this
case, the frame needs to be forwarded to the LAN segment attached to said
interface. The switch performs its forwarding function by putting the frame
in an output buffer that precedes that interface.</li>
</ul>
</div>
</div>

<div id="outline-container-org4c30668" class="outline-4">
<h4 id="org4c30668"><span class="section-number-4">1.2.2</span> self learning</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
the switch table is built automatically, dynamically, and
autonomously—without any intervention from a network administrator or from a
configuration protocol.
</p>

<ol class="org-ol">
<li>The switch table is initially empty.</li>
<li><p>
For each incoming frame received on an interface, the switch stores in
its table
</p>
<ol class="org-ol">
<li>the MAC address in the frame’s source address field,</li>
<li>the interface from which the frame arrived, and</li>
<li>the current time.</li>
</ol>
<p>
In this manner the switch records in its table the LAN segment on which
the sender resides. If every host in the LAN eventually sends a frame,
then every host will eventually get recorded in the table.
</p></li>
<li>The switch deletes an address in the table if no frames are received with
that address as the source address after some period of time (the aging
time).</li>
</ol>

<p>
Switches are <code>plug-and-play</code> devices because they require no intervention
from a network administrator or user. A network administrator wanting to
install a switch need do nothing more than connect the LAN segments to the
switch interfaces. The administrator need not configure the switch tables at
the time of installation or when a host is removed from one of the LAN
segments. Switches are also full-duplex, meaning any switch interface can
send and receive at the same time.
</p>
</div>
</div>

<div id="outline-container-orgdce1531" class="outline-4">
<h4 id="orgdce1531"><span class="section-number-4">1.2.3</span> Propiedades</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Ventajas por sobre enlaces de broadcast (buses o hubs):
</p>
<dl class="org-dl">
<dt>Elimination of collisions</dt><dd>In a LAN built from switches (and without
hubs), there is no wasted bandwidth due to collisions! The switches buffer
frames and never transmit more than one frame ona segment at any one
time. As with a router, the maximum aggregate throughput of a switch is the
sum of all the switch interface rates.</dd>
<dt>Heterogeneous links</dt><dd>Because a switch isolates one link from another, the
different links in the LAN can operate at different speeds and can run over
different media. A switch is ideal for mixing legacy equipment with new
equipment.</dd>
<dt>Management</dt><dd>In addition to providing enhanced security, a switch also
eases network management. For example, if an adapter malfunctions and
continually sends Ethernet frames (called a jabbering adapter), a switch
can detect the problem and internally disconnect the malfunctioning
adapter. Similarly, a cable cut disconnects only that host that was using
the cut cable to connect to the switch. In the days of coaxial cable, many
a network manager spent hours “walking the line” (or more accurately,
“crawling the floor”) to find the cable break that brought down the entire
network. Switches also gather statistics on bandwidth usage, collision
rates, and traffic types, and make this information available to the
network manager.This information can be used to debug and correct problems,
and to plan how the LAN should evolve in the future.</dd>
</dl>
</div>
</div>

<div id="outline-container-org36370f1" class="outline-4">
<h4 id="org36370f1"><span class="section-number-4">1.2.4</span> SNIFFING A SWITCHED LAN: SWITCH POISONING</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
When a host is connected to a switch, it typically only receives frames that
are intended for it. For example, consider a switched LAN in Figure
6.17. When host A sends a frame to host B, and there is an entry for host B
in the switch table, then the switch will forward the frame only to host
B. If host C happens to be running a sniffer, host C will not be able to
sniff this A-to-B frame. Thus, in a switched-LAN environment (in contrast to
a broadcast link environment suchas 802.11 LANs or hub–based Ethernet LANs),
it is more difficult for an attacker to sniff frames. However, because the
switch broadcasts frames that have destination addresses that are not in the
switch table, the sniffer at C can still sniff some frames that are not
intended for C. Furthermore, a sniffer will be able sniff all Ethernet
broadcast frames with broadcast destination address FF–FF–FF–FF–FF–FF. A
well-known attack against a switch, called switch poisoning,is to send tons
of packets to the switch with many different bogus source MAC addresses,
thereby filling the switch table with bogus entries and leaving no room for
the MAC addresses of the legitimate hosts. This causes the switch to
broadcast most frames, which can then be picked up by the sniffer [Skoudis
2006]. As this attack is rather involved even for a sophisticated attacker,
switches are significantly less vulnerable to sniffing than are hubs and
wireless LANs.
</p>
</div>
</div>

<div id="outline-container-org689132c" class="outline-4">
<h4 id="org689132c"><span class="section-number-4">1.2.5</span> Switches vs Routers 541</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
routers are store-and-forward packet switches that forward packets using
network-layer addresses. Although a switch is also a store-and-forward packet
switch, it is fundamentally different from a router in that it forwards packets
using MAC addresses
</p>

<p>
imagen 6.15 &#x2026; ?
</p>

<p>
imagen 6.24
</p>
</div>

<div id="outline-container-org9d5c86d" class="outline-5">
<h5 id="org9d5c86d"><span class="section-number-5">1.2.5.1</span> Switches</h5>
<div class="outline-text-5" id="text-1-2-5-1">
</div>
<div id="outline-container-orgf730125" class="outline-6">
<h6 id="orgf730125"><span class="section-number-6">1.2.5.1.1</span> Ventajas</h6>
<div class="outline-text-6" id="text-1-2-5-1-1">
<ul class="org-ul">
<li>plug and play</li>
<li>relatively high filtering and forwarding rates</li>
<li></li>
</ul>
</div>
</div>

<div id="outline-container-org72e24f9" class="outline-6">
<h6 id="org72e24f9"><span class="section-number-6">1.2.5.1.2</span> Desventajas</h6>
<div class="outline-text-6" id="text-1-2-5-1-2">
<ul class="org-ul">
<li>limits network topology to a tree, otherwise, broadcast frames could cycle
infinitely. (frames do not have ttl)</li>
<li>a large network requires a large ARP table in hosts and routers</li>
</ul>
</div>
</div>
</div>
