org/redes/13.org
***** Ventajas

      - does not limit the topology. because of ttl of the packet and the addressing
        is hierarchical
      - provide firewall protection against broadcast stomrs

***** Desventajas

      - not plug and play. needs IP address to be configured
      - packet-processing-time is larger for routers than for switches


**** .

     |                   | Hubs | Routers | Switches |
     | Traffic isolation | No   | Yes     | Yes      |
     | Plug and play     | Yes  | No      | Yes      |
     | Optimal routing   | No   | Yes     | No       |


** VLAN

   imagen 6.15

   desventajas encontradas en la configuracion de la imagen
   - Lack of traffic isolation :: Although the hierarchy localizes group traffic to
     within a single switch, broadcast traffic must still traverse the entire
     institutional network. Limiting the scope of such broadcast traffic would
     improve LAN performance. Perhaps more importantly, it also may be desirable to
     limit LAN broadcast traffic for security/privacy reasons. This type of
     isolation could be provided by replacing the center switch in Figure 6.15 with
     a router. We’ll see shortly that this isolation also can be achieved via a
     layer-2-switch solution.
   - Inefficient use of switches :: If instead of three groups, the institution had
     10 groups, then 10 first-level switches would be required. If each group were
     small, say less than 10 people, then a single 96-port switch would likely be
     large enough to accommodate everyone, but this single switch would not provide
     traffic isolation.
   - Managing users :: If an employee moves between groups, the physical cabling
     must be changed to connect the employee to a different switch in Figure
     6.15. Employees belonging to two groups make the problem even harder

   Fortunately, each of these difficulties can be handled by a switch that supports
   =virtual local areanetworks (VLANs)=.

   a switch that supports VLANs allows multiple virtual lans to be defined over a
   single physical lan infrastructure. Hosts within a VLAN communicate with each
   other as if they (and no other hosts) were connected to the switch. In a
   =port-based= VLAN, the switch’s ports (interfaces) are divided into groups by
   the network manager. Each group constitutes a VLAN, with the ports in each VLAN
   forming a broadcast domain (i.e., broadcast traffic from one port can only reach
   other ports in the group).

   Figure 6.25 shows a single switch with 16 ports. Ports 2 to 8 belong to the EE
   VLAN, while ports 9 to 15 belong to the CS VLAN (ports 1 and 16 are
   unassigned). This VLAN solves all of the difficulties noted above — EE and CS
   VLAN frames are isolated from each other, the two switches in Figure 6.15 have
   been replaced by a single switch, and if the user at switch port 8 joins the CS
   Department, the network operator simply reconfigures the VLAN software so that
   port 8 is now associated with the CS VLAN. One can easily imagine how the VLAN
   switch is configured and operates — the network manager declares a port to
   belong to a given VLAN (with undeclared ports belonging to a default VLAN) using
   switch management software, a table of port-to-VLAN mappings is maintained
   within the switch; and switch hardware only delivers frames between ports
   belonging to the same VLAN.

   imagen 6.25

   How can traffic from the EE Department be sent to the CS Department? One way to
   handle this would be to connect a VLAN switch port (e.g., port 1 in Figure 6.25)
   to an external router and configure that port to belong both the EE and CS
   VLANs. In this case, even though the EE and CS departments share the same
   physical switch, the logical configuration would look as if the EE and CS
   departments had separate switches connected via a router. An IP datagram going
   from the EE to the CS department would first cross the EE VLAN to reach the
   router and then be forwarded by the router back over the CS VLAN to the CS host.


   Suppose now that members of EE VLAN and CS VLAN are in a different building, but
   want to be connected to their respective department VLAN. A way to interconnect
   VLAN switches is known as =VLAN Trunking= (imagen 6.26 b).

   imagen 6.26

   A special port on each switch (port 16 on the left switch and port 1 on the
   right switch) is configured as a =trunk port= to interconnect the two VLAN
   switches. The trunk port belongs to all VLANs, and frames sent to any VLAN are
   forwarded over the =trunk link= to the other switch.

   (Este puerto especial es para hacer broadcast a todos los switches. Luego el
   switch que recibe se encarga de hacer broadcast a los puertos de la VLAN
   correspondiente)

   How does a switch know that a frame arriving on a trunk port belongs to a
   particular VLAN? The IEEE has defined an extended Ethernet frame format,
   802.1Q, for frames crossing a VLAN trunk.

   imagen 6.27

   the 802.1Q frame consists of the standard Ethernet frame with a four-byte =VLAN
   tag= added into the header that carries the identity of the VLAN to which the
   frame belongs. The VLAN tag is added into a frame by the switch at the sending
   side of a VLAN trunk, parsed, and removed by the switch at the receiving side of
   the trunk. The VLAN tag consists of
   - a 2-byte Tag Protocol Identifier (TPID) field (with a fixed hexadecimal value
     of 81-00),
   - a 2-byte Tag Control Information field that contains a 12-bit VLAN identifier
     field, and
   - a 3-bit priority field that is similar in intent to the IP datagram TOS field.


   Tambien existen la VLANs basadas en MAC. El administrador de red, configura un
   conjunto de direcciones MAC que pertenecen a una VLAN.

   Otra forma de definir VLANs es basada en protocolos de capa de red (IPv4, IPv6,
   Appletalk) y otros criterios.

* DONE Virtualizacion de enlaces 548

