redes/13.html

<div id="outline-container-orgdc2e4c6" class="outline-5">
<h5 id="orgdc2e4c6"><span class="section-number-5">1.2.5.2</span> Routers</h5>
<div class="outline-text-5" id="text-1-2-5-2">
</div>
<div id="outline-container-org4ab17bc" class="outline-6">
<h6 id="org4ab17bc"><span class="section-number-6">1.2.5.2.1</span> Ventajas</h6>
<div class="outline-text-6" id="text-1-2-5-2-1">
<ul class="org-ul">
<li>does not limit the topology. because of ttl of the packet and the addressing
is hierarchical</li>
<li>provide firewall protection against broadcast stomrs</li>
</ul>
</div>
</div>

<div id="outline-container-org226c43c" class="outline-6">
<h6 id="org226c43c"><span class="section-number-6">1.2.5.2.2</span> Desventajas</h6>
<div class="outline-text-6" id="text-1-2-5-2-2">
<ul class="org-ul">
<li>not plug and play. needs IP address to be configured</li>
<li>packet-processing-time is larger for routers than for switches</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org700f7f5" class="outline-5">
<h5 id="org700f7f5"><span class="section-number-5">1.2.5.3</span> .</h5>
<div class="outline-text-5" id="text-1-2-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Hubs</td>
<td class="org-left">Routers</td>
<td class="org-left">Switches</td>
</tr>

<tr>
<td class="org-left">Traffic isolation</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Plug and play</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Optimal routing</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>


<div id="outline-container-org70a8aa5" class="outline-3">
<h3 id="org70a8aa5"><span class="section-number-3">1.3</span> VLAN</h3>
<div class="outline-text-3" id="text-1-3">
<p>
imagen 6.15
</p>

<p>
desventajas encontradas en la configuracion de la imagen
</p>
<dl class="org-dl">
<dt>Lack of traffic isolation</dt><dd>Although the hierarchy localizes group traffic to
within a single switch, broadcast traffic must still traverse the entire
institutional network. Limiting the scope of such broadcast traffic would
improve LAN performance. Perhaps more importantly, it also may be desirable to
limit LAN broadcast traffic for security/privacy reasons. This type of
isolation could be provided by replacing the center switch in Figure 6.15 with
a router. We’ll see shortly that this isolation also can be achieved via a
layer-2-switch solution.</dd>
<dt>Inefficient use of switches</dt><dd>If instead of three groups, the institution had
10 groups, then 10 first-level switches would be required. If each group were
small, say less than 10 people, then a single 96-port switch would likely be
large enough to accommodate everyone, but this single switch would not provide
traffic isolation.</dd>
<dt>Managing users</dt><dd>If an employee moves between groups, the physical cabling
must be changed to connect the employee to a different switch in Figure
6.15. Employees belonging to two groups make the problem even harder</dd>
</dl>

<p>
Fortunately, each of these difficulties can be handled by a switch that supports
<code>virtual local areanetworks (VLANs)</code>.
</p>

<p>
a switch that supports VLANs allows multiple virtual lans to be defined over a
single physical lan infrastructure. Hosts within a VLAN communicate with each
other as if they (and no other hosts) were connected to the switch. In a
<code>port-based</code> VLAN, the switch’s ports (interfaces) are divided into groups by
the network manager. Each group constitutes a VLAN, with the ports in each VLAN
forming a broadcast domain (i.e., broadcast traffic from one port can only reach
other ports in the group).
</p>

<p>
Figure 6.25 shows a single switch with 16 ports. Ports 2 to 8 belong to the EE
VLAN, while ports 9 to 15 belong to the CS VLAN (ports 1 and 16 are
unassigned). This VLAN solves all of the difficulties noted above — EE and CS
VLAN frames are isolated from each other, the two switches in Figure 6.15 have
been replaced by a single switch, and if the user at switch port 8 joins the CS
Department, the network operator simply reconfigures the VLAN software so that
port 8 is now associated with the CS VLAN. One can easily imagine how the VLAN
switch is configured and operates — the network manager declares a port to
belong to a given VLAN (with undeclared ports belonging to a default VLAN) using
switch management software, a table of port-to-VLAN mappings is maintained
within the switch; and switch hardware only delivers frames between ports
belonging to the same VLAN.
</p>

<p>
imagen 6.25
</p>

<p>
How can traffic from the EE Department be sent to the CS Department? One way to
handle this would be to connect a VLAN switch port (e.g., port 1 in Figure 6.25)
to an external router and configure that port to belong both the EE and CS
VLANs. In this case, even though the EE and CS departments share the same
physical switch, the logical configuration would look as if the EE and CS
departments had separate switches connected via a router. An IP datagram going
from the EE to the CS department would first cross the EE VLAN to reach the
router and then be forwarded by the router back over the CS VLAN to the CS host.
</p>


<p>
Suppose now that members of EE VLAN and CS VLAN are in a different building, but
want to be connected to their respective department VLAN. A way to interconnect
VLAN switches is known as <code>VLAN Trunking</code> (imagen 6.26 b).
</p>

<p>
imagen 6.26
</p>

<p>
A special port on each switch (port 16 on the left switch and port 1 on the
right switch) is configured as a <code>trunk port</code> to interconnect the two VLAN
switches. The trunk port belongs to all VLANs, and frames sent to any VLAN are
forwarded over the <code>trunk link</code> to the other switch.
</p>

<p>
(Este puerto especial es para hacer broadcast a todos los switches. Luego el
switch que recibe se encarga de hacer broadcast a los puertos de la VLAN
correspondiente)
</p>

<p>
How does a switch know that a frame arriving on a trunk port belongs to a
particular VLAN? The IEEE has defined an extended Ethernet frame format,
802.1Q, for frames crossing a VLAN trunk.
</p>

<p>
imagen 6.27
</p>

<p>
the 802.1Q frame consists of the standard Ethernet frame with a four-byte <code>VLAN
   tag</code> added into the header that carries the identity of the VLAN to which the
frame belongs. The VLAN tag is added into a frame by the switch at the sending
side of a VLAN trunk, parsed, and removed by the switch at the receiving side of
the trunk. The VLAN tag consists of
</p>
<ul class="org-ul">
<li>a 2-byte Tag Protocol Identifier (TPID) field (with a fixed hexadecimal value
of 81-00),</li>
<li>a 2-byte Tag Control Information field that contains a 12-bit VLAN identifier
field, and</li>
<li>a 3-bit priority field that is similar in intent to the IP datagram TOS field.</li>
</ul>


<p>
Tambien existen la VLANs basadas en MAC. El administrador de red, configura un
conjunto de direcciones MAC que pertenecen a una VLAN.
</p>

<p>
Otra forma de definir VLANs es basada en protocolos de capa de red (IPv4, IPv6,
Appletalk) y otros criterios.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd3200f0" class="outline-2">
<h2 id="orgd3200f0"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Virtualizacion de enlaces 548</h2>
<div class="outline-text-2" id="text-2">
</div>
