org/redes/13.org
** Multiprotocol Label Switching (MPLS)

   The goal was not to abandon the destination-based IP datagram-forwarding
   infrastructure for one based on fixed-length labels and virtual circuits, but to
   augment it by selectively labeling datagrams and allowing routers to forward
   datagrams based on fixed-length labels (rather than destination IP addresses)
   when possible. Importantly, these techniques work hand-in-hand with IP, using IP
   addressing and routing. The IETF unified these efforts in the MPLS protocol
   [RFC 3031, RFC 3032], effectively blending VC techniques into a routed datagram
   network.

   imagen 6.28

   La imagen muestra un frame que es transmitido entre dispositivos que soportan
   MPLS. Contiene un header MPLS entre los headers de capa 2 y 3 (Ethernet e IP
   respectivamente).

   Dentro del header MPLS se encuetra:
   - el label
   - 3 bits para uso experimental
   - 1 bit "S" para indicar el fin de una serie de header MPLS "apilados"
   - campo ttl

   Un router que soporta MPLS se lo llama =label-switched router= ya que envia
   frames MPLS con solo observar el label MPLS y buscarlo en la forwarding table.
   Es decir, no extrae la IP de destino y busca el LPM en la forwarding table.

   Como sabe el router que su vecino soporta MPLS? Como asocia un label con una
   direccion IP?

   imagen 6.29

   - routers R1 through R4 are MPLS capable.
   - R5 and R6 are standard IP routers.
   - R1 has advertised to R2 and R3 that it (R1) can route to destination A, with
     MPLS label 6.
   - Router R3 has advertised to router R4 that it can route to destinations A and
     D, with labels 10 and 12 respectively.
   - Router R2 has also advertised to router R4 that it (R2) can reach destination
     A, with a MPLS label 8.

   Note that router R4 has two MPLS paths to reach A.

   R5, R6, A y D, estan conectados mediante la infraestructura MPLS, tanto como una
   switched LAN y red de ATMs que conectan dispositivos IP, y tanto como estos, los
   routers que soportan MPLS lo hacen sin tocar el header IP de un paquete.

   En el libro no se ve el protocolo utilizado por los routers MPLS para distribuir
   los labels.

   ver [RFC 3468] [RFC 3209].

   tampoco se especifica como se calculan los caminos por los cuales los paquetes
   deben fluir dentro de la red de routers MPLS, ni tampoco como se recolecta la
   informacion de los enlaces en dichos caminos.

   Lo mas importante de MPLS es la capacidad de manejo de trafico que permite
   realizar. El protocolo IP especificaria un solo camino de costo minimo por el
   cual un paquete debe seguir, pero MPLS provee varias rutas. Tambien se puede
   usar MPLS para restaurar caminos de forma mas rapida en caso de haber fallas de
   enlace.

   tambien se usan para implementar VPNs y separar el trafico de clientes de VPN y
   clientes regulares.

* DONE Netwroking de Data Centers 552

  Each data center has its own =data center network= that interconnects its hosts
  with each other and interconnects the data center with the Internet.

  The worker bees in a data center are the hosts: They serve content (e.g., Web
  pages and videos), store e-mails and documents, and collectively perform
  massively distributed computations (e.g., distributed index computations for
  search engines). The hosts in data centers, called =blades=, are generally
  commodity hosts that include CPU, memory, and disk storage. The hosts are
  stacked in racks, with each rack typically having 20 to 40 blades.

  At the top of each rack there is a switch, named the =Top of Rack (TOR) switch=,
  that interconnects the hosts in the rack with each other and with other switches
  in the data center.

  Each host is also assigned its own data-center-internal IP address.

  two types of traffic:
  1. traffic flowing between external clients and internal hosts the data center
     network includes one or more =border routers= to handle this type of
     traffic. The data center network therefore interconnects the racks with each
     other and connects the racks to the border routers.
  2. traffic flowing between internal hosts.

  imagen 6.30

** Balance de Carga

   Los data centers proveen varias aplicaciones de forma concurrente. para
   soportar multiples pedidos de clientes externos, cada aplicacion esta
   asociada a una IP publica. dentro del data center, las consultas se redirigen
   a un =load balancer= para que distribuya las consultas entre los
   hosts. Tambien se lo llama =layer 4 switch= porque puede tomar desiciones de
   forwardeo basado en el puerto destino (capa 4) y tambien por la ip de destino
   del paquete (capa 3). Luego de que el host procese la consulta, se la envia
   de vuelta al load balancer, para que este se lo devuelva al cliente.

   el load balancer tambien funciona como NAT, al traducir las ip publicas a
   direcciones ip internas

** Arquitectura Jerarquica

imagen 6.30

At the top of the hierarchy, the border router connects to access routers. Below
each access router there are three tiers of switches. Each access router
connects to a top-tier switch, and each top-tier switch connects to multiple
second-tier switches and a load balancer. Each second-tier switch in turn
connects to multiple racks via the racks’ TOR switches (third-tier
switches). All links typically use Ethernet for their link-layer and
physical-layer protocols, with a mix of copper and fiber cabling.

Como es necesario para aplicaciones en la nube proveer servicios de forma
continua, los data centers tambien incluyen equipo y enlaces redundantes. For
example, each TOR switch can connect to two tier-2 switches, and each access
router, tier-1 switch, and tier-2 switch can be duplicated and integrated into
the design.

observe that the hosts below each access router form a single subnet. In order
to localize ARP broadcast traffic, each of these subnets is further partitioned
into smaller VLAN subnets.

La arquitectura de la imagen resuelve el problema de escalabilidad, pero sufre
de limitacion en capacidad entre hosts (host-to-host capacity). Puede haber
multiples conexiones simultaneas entre hosts de un lado de la red hacia el otro,
pero la velocidad del enlace de los switches y routers es limitante. Una
solucion es obtener switches y routers de mayor velocidad, pero esto es mas
costoso.

** Tendencias

Para reducir costos y mejorar el delay y throughput, se crean nuevas
arquitecturas y protocolos de red.

*** Fully Connected Topology
Un metodo es reemplazar la jerarquia de switches y routers por una =fully
connected topology=.

imagen 6.31

cada switch de tier 1 se conecta con todos los switches de tier 2 para:
1. que el trafico host-to-host no suba por mas arriba que el tier de switches
2. con $n$ switches de tier 1, hay $n$ caminos disjuntos entre 2 switches de
   tier 2 cualesquiera.

