redes/13.html
<div id="outline-container-orgdcd5789" class="outline-3">
<h3 id="orgdcd5789"><span class="section-number-3">2.1</span> Multiprotocol Label Switching (MPLS)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The goal was not to abandon the destination-based IP datagram-forwarding
infrastructure for one based on fixed-length labels and virtual circuits, but to
augment it by selectively labeling datagrams and allowing routers to forward
datagrams based on fixed-length labels (rather than destination IP addresses)
when possible. Importantly, these techniques work hand-in-hand with IP, using IP
addressing and routing. The IETF unified these efforts in the MPLS protocol
[RFC 3031, RFC 3032], effectively blending VC techniques into a routed datagram
network.
</p>

<p>
imagen 6.28
</p>

<p>
La imagen muestra un frame que es transmitido entre dispositivos que soportan
MPLS. Contiene un header MPLS entre los headers de capa 2 y 3 (Ethernet e IP
respectivamente).
</p>

<p>
Dentro del header MPLS se encuetra:
</p>
<ul class="org-ul">
<li>el label</li>
<li>3 bits para uso experimental</li>
<li>1 bit "S" para indicar el fin de una serie de header MPLS "apilados"</li>
<li>campo ttl</li>
</ul>

<p>
Un router que soporta MPLS se lo llama <code>label-switched router</code> ya que envia
frames MPLS con solo observar el label MPLS y buscarlo en la forwarding table.
Es decir, no extrae la IP de destino y busca el LPM en la forwarding table.
</p>

<p>
Como sabe el router que su vecino soporta MPLS? Como asocia un label con una
direccion IP?
</p>

<p>
imagen 6.29
</p>

<ul class="org-ul">
<li>routers R1 through R4 are MPLS capable.</li>
<li>R5 and R6 are standard IP routers.</li>
<li>R1 has advertised to R2 and R3 that it (R1) can route to destination A, with
MPLS label 6.</li>
<li>Router R3 has advertised to router R4 that it can route to destinations A and
D, with labels 10 and 12 respectively.</li>
<li>Router R2 has also advertised to router R4 that it (R2) can reach destination
A, with a MPLS label 8.</li>
</ul>

<p>
Note that router R4 has two MPLS paths to reach A.
</p>

<p>
R5, R6, A y D, estan conectados mediante la infraestructura MPLS, tanto como una
switched LAN y red de ATMs que conectan dispositivos IP, y tanto como estos, los
routers que soportan MPLS lo hacen sin tocar el header IP de un paquete.
</p>

<p>
En el libro no se ve el protocolo utilizado por los routers MPLS para distribuir
los labels.
</p>

<p>
ver [RFC 3468] [RFC 3209].
</p>

<p>
tampoco se especifica como se calculan los caminos por los cuales los paquetes
deben fluir dentro de la red de routers MPLS, ni tampoco como se recolecta la
informacion de los enlaces en dichos caminos.
</p>

<p>
Lo mas importante de MPLS es la capacidad de manejo de trafico que permite
realizar. El protocolo IP especificaria un solo camino de costo minimo por el
cual un paquete debe seguir, pero MPLS provee varias rutas. Tambien se puede
usar MPLS para restaurar caminos de forma mas rapida en caso de haber fallas de
enlace.
</p>

<p>
tambien se usan para implementar VPNs y separar el trafico de clientes de VPN y
clientes regulares.
</p>
</div>
</div>
</div>

<div id="outline-container-org237fb15" class="outline-2">
<h2 id="org237fb15"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> Netwroking de Data Centers 552</h2>
<div class="outline-text-2" id="text-3">
<p>
Each data center has its own <code>data center network</code> that interconnects its hosts
with each other and interconnects the data center with the Internet.
</p>

<p>
The worker bees in a data center are the hosts: They serve content (e.g., Web
pages and videos), store e-mails and documents, and collectively perform
massively distributed computations (e.g., distributed index computations for
search engines). The hosts in data centers, called <code>blades</code>, are generally
commodity hosts that include CPU, memory, and disk storage. The hosts are
stacked in racks, with each rack typically having 20 to 40 blades.
</p>

<p>
At the top of each rack there is a switch, named the <code>Top of Rack (TOR) switch</code>,
that interconnects the hosts in the rack with each other and with other switches
in the data center.
</p>

<p>
Each host is also assigned its own data-center-internal IP address.
</p>

<p>
two types of traffic:
</p>
<ol class="org-ol">
<li>traffic flowing between external clients and internal hosts the data center
network includes one or more <code>border routers</code> to handle this type of
traffic. The data center network therefore interconnects the racks with each
other and connects the racks to the border routers.</li>
<li>traffic flowing between internal hosts.</li>
</ol>

<p>
imagen 6.30
</p>
</div>

<div id="outline-container-org94fe83f" class="outline-3">
<h3 id="org94fe83f"><span class="section-number-3">3.1</span> Balance de Carga</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Los data centers proveen varias aplicaciones de forma concurrente. para
soportar multiples pedidos de clientes externos, cada aplicacion esta
asociada a una IP publica. dentro del data center, las consultas se redirigen
a un <code>load balancer</code> para que distribuya las consultas entre los
hosts. Tambien se lo llama <code>layer 4 switch</code> porque puede tomar desiciones de
forwardeo basado en el puerto destino (capa 4) y tambien por la ip de destino
del paquete (capa 3). Luego de que el host procese la consulta, se la envia
de vuelta al load balancer, para que este se lo devuelva al cliente.
</p>

<p>
el load balancer tambien funciona como NAT, al traducir las ip publicas a
direcciones ip internas
</p>
</div>
</div>

<div id="outline-container-org2a24b91" class="outline-3">
<h3 id="org2a24b91"><span class="section-number-3">3.2</span> Arquitectura Jerarquica</h3>
<div class="outline-text-3" id="text-3-2">
<p>
imagen 6.30
</p>

<p>
At the top of the hierarchy, the border router connects to access routers. Below
each access router there are three tiers of switches. Each access router
connects to a top-tier switch, and each top-tier switch connects to multiple
second-tier switches and a load balancer. Each second-tier switch in turn
connects to multiple racks via the racks’ TOR switches (third-tier
switches). All links typically use Ethernet for their link-layer and
physical-layer protocols, with a mix of copper and fiber cabling.
</p>

<p>
Como es necesario para aplicaciones en la nube proveer servicios de forma
continua, los data centers tambien incluyen equipo y enlaces redundantes. For
example, each TOR switch can connect to two tier-2 switches, and each access
router, tier-1 switch, and tier-2 switch can be duplicated and integrated into
the design.
</p>

<p>
observe that the hosts below each access router form a single subnet. In order
to localize ARP broadcast traffic, each of these subnets is further partitioned
into smaller VLAN subnets.
</p>

<p>
La arquitectura de la imagen resuelve el problema de escalabilidad, pero sufre
de limitacion en capacidad entre hosts (host-to-host capacity). Puede haber
multiples conexiones simultaneas entre hosts de un lado de la red hacia el otro,
pero la velocidad del enlace de los switches y routers es limitante. Una
solucion es obtener switches y routers de mayor velocidad, pero esto es mas
costoso.
</p>
</div>
</div>

<div id="outline-container-org6f82c05" class="outline-3">
<h3 id="org6f82c05"><span class="section-number-3">3.3</span> Tendencias</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Para reducir costos y mejorar el delay y throughput, se crean nuevas
arquitecturas y protocolos de red.
</p>
</div>

<div id="outline-container-org2002c5a" class="outline-4">
<h4 id="org2002c5a"><span class="section-number-4">3.3.1</span> Fully Connected Topology</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Un metodo es reemplazar la jerarquia de switches y routers por una <code>fully
connected topology</code>.
</p>

<p>
imagen 6.31
</p>

<p>
cada switch de tier 1 se conecta con todos los switches de tier 2 para:
</p>
<ol class="org-ol">
<li>que el trafico host-to-host no suba por mas arriba que el tier de switches</li>
<li>con \(n\) switches de tier 1, hay \(n\) caminos disjuntos entre 2 switches de
tier 2 cualesquiera.</li>
</ol>
</div>
</div>
