org/redes/13.org
*** Modular Data Center (MDC)

Se crean pequeños data centers dentro de contenedores de 12 metros y se envian a
la ubicacion del data center, en la cual se interconectan los contenedores entre
si y la internet. Una vez desplegado, un contenedor es dificil de mantener por
lo que estan diseñados para operar con menor performance a medida que se van
degradando.

con este metodo, hay dos tipos de redes:
1. las redes dentro de los contenedores y
2. la red que conecta a cada contenedor

la dificultad se encuetra en el 2do tipo de red, ya que hay problemas para
proveer un alto ancho de banda para conexiones host-to-host.


en topologias altamente interconectadas, el diseño de algoritmos de ruteo entre
switches se vuelve un problema. soluciones: (1) random routing, (2) multiples
NICs en cada host y conectar cada interfaz a un switch de bajo costo y dejar que
los hosts resulevan el ruteo del trafico entre los switches.

             