redes/13.html

<div id="outline-container-org00ef675" class="outline-4">
<h4 id="org00ef675"><span class="section-number-4">3.3.2</span> Modular Data Center (MDC)</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Se crean pequeños data centers dentro de contenedores de 12 metros y se envian a
la ubicacion del data center, en la cual se interconectan los contenedores entre
si y la internet. Una vez desplegado, un contenedor es dificil de mantener por
lo que estan diseñados para operar con menor performance a medida que se van
degradando.
</p>

<p>
con este metodo, hay dos tipos de redes:
</p>
<ol class="org-ol">
<li>las redes dentro de los contenedores y</li>
<li>la red que conecta a cada contenedor</li>
</ol>

<p>
la dificultad se encuetra en el 2do tipo de red, ya que hay problemas para
proveer un alto ancho de banda para conexiones host-to-host.
</p>


<p>
en topologias altamente interconectadas, el diseño de algoritmos de ruteo entre
switches se vuelve un problema. soluciones: (1) random routing, (2) multiples
NICs en cada host y conectar cada interfaz a un switch de bajo costo y dejar que
los hosts resulevan el ruteo del trafico entre los switches.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-09-16 12:29
</div>
</body>
</html>
